-- Sample Data Insertion
-- =====================

-- This script is responsible for populating the empty database 
-- structure with illustrative data. It inserts a diverse set 
-- of records into all relations, including:
--     - Clients: Both individual and corporate entities.
--     - Project types: Standard service categories like Wedding 
--       and Product photography.
--     - Projects and Sessions: Specific business engagements with 
--       their respective locations and dates.
--     - Employees and Skills: Staff members linked to their 
--       professional capabilities and proficiency levels.

USE VD_Studio
GO

INSERT INTO Clients
    ( name, phone, email, town, address, company_number, VAT_number )
VALUES
    (
        '"Господинови" ООД',
        '+35952551151',
        'gospodin@gmail.com',
        'гр. Суворово',
        'ул. Григор Димитров, № 1',
        '897235786',
        'BG897235786'
    ),
    (
        'Атанас Михайлов Атанасов',
        '+359878781644',
        'nasatanas_@gmail.com',
        'гр. София',
        'кв. Факултета, бл. 1, вх. А, ап. 1, ет. 1 ',
        NULL,
        NULL
    ),
    (
        'Снежина Янкова Желева',
        '+48735753999',
        'snej@abv.bg',
        'гр. Добрич',
        'кв. Балик, бл. 12, вх. Г, ап. 4, ет. 2',
        NULL,
        NULL
    ),
    (
        'Минка Александрова Иванова',
        '+359886996111',
        'mina_zamina@abv.bg',
        'гр. Свети Влас',
        'ул. Свети Власий, № 44',
        NULL,
        NULL
    ),
    (
        'Димитър Киров Костадинов ',
        '+359894843272',
        'dimo111@gmail.com',
        'гр. Добрич',
        'ул. Преслава, № 11',
        NULL,
        NULL
    ),
    (
        '"Галин и Теди" СД',
        '+359888875757',
        'td666666@hotmail.com',
        'гр. Варна',
        'ул. Орфей, № 188',
        '235245523',
        NULL
    )

INSERT INTO Project_types ( name )
VALUES
    ( 'Рекламна фотография за продукт' ),
    ( 'Абитуриентски албуми'           ),
    ( 'Семейна фотосесия'              ),
    ( 'Сватбена фотография'            ),
    ( 'Детска фотосесия'               )

INSERT INTO Projects
    (
        type_id,
        client_id,
        name,
        contract_number,
        contract_date,
        price,
        is_paid,
        is_completed,
        additional_notes
    )
VALUES
    (
        1,
        1,
        'Каталожна продуктова фотосесия – Господинови ООД',
        101,
        '2024-11-10',
        750.00,
        1,
        1,
        '25 обработени кадъра'
    ),
    (
        2,
        2,
        'Абитуриентски албум на 12 „А“ клас, ПАЕГ - София',
        96,
        '2024-04-20',
        140.00,
        0,
        0,
        NULL
    ),
    (
        3,
        3,
        'Семейна фотосесия „Желева“ – Коледна тематика',
        342,
        '2025-12-01',
        260.00,
        1,
        0,
        '15 обработени снимки'
    ),
    (
        4,
        6,
        'Сватбен ден – Галин & Теди – Свети Влас',
        289,
        '2025-11-05',
        1850.00,
        1,
        0,
        'Цялостно заснемане и видео'
    ),
    (
        5,
        5,
        'Детска фотосесия „Първи рожден ден“ – Костадинови',
        541,
        '2025-12-05',
        180.00,
        1,
        1,
        NULL
    ),
    (
        1,
        3,
        'Рекламни продуктови снимки за онлайн магазин – Желева',
        12,
        '2025-01-12',
        450.00,
        1,
        0,
        NULL
    ),
    (
        3,
        2,
        'Семейна фотосесия в парк „Запад“, София – Атанасови',
        112,
        '2025-03-14',
        250.00,
        0,
        0,
        'На открито'
    ),
    (
        4,
        4,
        'Сватбена фотосесия – Минка & Галин – Свети Влас',
        211,
        '2025-10-01',
        2000.00,
        1,
        0,
        'Цял ден снимане'
    ),
    (
        5,
        1,
        'Детска фотосесия за първокласник',
        50,
        '2025-02-03',
        150.00,
        1,
        1,
        NULL
    ),
    (
        2,
        5,
        'Абитуриентски албум на 12 „Б“ клас, ФСГ - Добрич',
        126,
        '2025-05-16',
        300.00,
        0,
        0,
        'Пакет "Премиум"'
    )

INSERT INTO Sessions ( project_id, location, date_and_time )
VALUES
    ( 1,  'Студио Варна',                      '2024-11-11 12:00' ),
    ( 8,  'Тракийски скали',                   '2025-04-24 08:00' ),
    ( 3,  'Студио Добрич',                     '2025-12-12 16:15' ),
    ( 4,  'ресторант Ривера, Добрич',          '2025-11-08 14:00' ),
    ( 5,  'ресторант Европа, Добрич',          '2025-12-23 17:00' ),
    ( 10, 'Градски парк "Св. Георги", Добрич', '2025-05-20 15:00' ),
    ( 2,  'София - Борисова градина',          '2025-04-25 18:00' ),
    ( 6,  'Студио Варна',                      '2025-01-15 10:00' ),
    ( 7,  'Парк "Запад", София',               '2025-03-16 14:30' ),
    ( 9,  'Студио Варна',                      '2025-02-05 09:00' ),
    ( 1,  'Студио Варна',                      '2024-11-12 10:00' ),
    ( 8,  'Хотел "Марина"',                    '2025-10-02 17:00' ),
    ( 3,  'Литературен музей, Добрич',         '2025-12-15 13:00' ),
    ( 4,  'Свети Влас - плаж',                 '2025-11-09 10:00' ),
    ( 5,  'Студио Добрич',                     '2025-12-23 11:00' )

INSERT INTO Employees
    ( name, surname, email, phone, town, address, is_active )
VALUES
    (
        'Михаела',
        'Мицова',
        'mihaela.m@vd_studio.bg',
        '+359899300101',
        'гр. Варна',
        'ул. Кайсия, № 9',
        1
    ),
    (
        'Георги',
        'Велев',
        'velevg@vd_studio.bg',
        '+359894748454',
        'гр. Добрич',
        'ул. Искър, № 75',
        1
    ),
    (
        'Николай',
        'Зафиров',
        'niki@vd_studio.bg',
        '+359877555123',
        'гр. София',
        'ул. Лилиум, № 16',
        1
    ),
    (
        'Деян',
        'Недялков',
        'nedqlkov.d@vd_studio.bg',
        '+359887636521',
        'гр. Добрич',
        'ул. Роза, № 86',
        1
    ),
    (
        'Деян',
        'Стоев',
        'stoev@vd_studio.bg',
        '+359886947513',
        'гр. Варна',
        'ул. Дунав, № 33',
        0
    )

INSERT INTO Session_teams ( session_id, employee_id, role )
VALUES
    ( 1,  1, 'фотограф'      ),
    ( 1,  2, 'асистент'      ),
    ( 2,  1, 'фотограф'      ),
    ( 2,  3, 'осветление'    ),
    ( 3,  3, 'фотограф'      ),
    ( 4,  1, 'фотограф'      ),
    ( 4,  2, 'асистент'      ),
    ( 5,  3, 'фотограф'      ),
    ( 6,  4, 'фотограф'      ),
    ( 7,  4, 'фотограф'      ),
    ( 8,  3, 'дрон оператор' ),
    ( 9,  3, 'фотограф'      ),
    ( 10, 1, 'фотограф'      ),
    ( 11, 1, 'фотограф'      ),
    ( 11, 2, 'осветление'    ),
    ( 12, 1, 'фотограф'      ),
    ( 12, 3, 'видеооператор' ),
    ( 13, 3, 'фотограф'      ),
    ( 14, 1, 'фотограф'      ),
    ( 14, 2, 'асистент'      )

INSERT INTO Skills ( name )
VALUES
    ( 'Фотография'     ),
    ( 'Видеообработка' ),
    ( 'Осветление'     ),
    ( 'Photoshop'      ),
    ( 'Дрон оператор'  )

INSERT INTO Employee_skills ( employee_id, skill_id, level_of_skill )
VALUES
    ( 1, 1, 5 ),
    ( 1, 3, 4 ),
    ( 1, 4, 4 ),
    ( 2, 1, 4 ),
    ( 2, 3, 5 ),
    ( 3, 1, 4 ),
    ( 3, 4, 3 ),
    ( 3, 5, 2 ),
    ( 4, 1, 5 ),
    ( 4, 4, 5 )

GO